function page() {
  return (
    <main>
      <div className="text-wrap">
        <p className="text-[25px] font-semibold">
          Let&apos;s learn English together!
        </p>

        <div className="flex flex-row mt-[20px] border-b-[1px] border-b-gray-200 items-top justify-between">
          <div className="flex flex-col">
            {" "}
            <div className=" text-[20px]">
              Клуб английского языка &apos;Shakespeare&apos; (Шэкспир), изучение
              английского через погружение в историю и литературу.
            </div>
            <p className="mt-[10px]">
              {" "}
              При изучении английского проблема возникает в первую очередь с
              дисциплиной, у клуба будет фиксированное время и вам нужно будет
              лишь прийти в указанное место, а там вы уже сами захотите учиться!
              Голосованием будет выбираться тема изучения, книга или фильм, по
              ней будет обсуждение в парах а после самостоятельное написание
              рецензии, совместный разбор работ. После завершения данной темы
              пишется общая рецензия или учебные материалы по теме. Также раз в
              неделю будем разбирать тест IELTS, фиксировать результаты и свои
              ошибки.
            </p>
          </div>
          <img
            src="/Telegram Desktop/english.png"
            className="  mt-[-50px] mr-[-20px] w-[300px]"
          />
        </div>
      </div>
      <div className="text-wrap">
        <p className="font-semibold">Структура занятия</p>
        <p>Занятие 1. - 1ч 30 мин </p>
        <p>14:00-14:20 - Обсуждение прочитанного в парах/тройках</p>
        <p>14:20 - 15:00 - Решение тестовой части IELTS</p>
        <p>
          15:00-15:30 - Написание эссе или совместная подготовка учебных
          материалов и статей по пройденной теме{" "}
        </p>

        <p> Заняти 2. - 1ч 30 мин </p>
        <p> 14:00 - 14:20 - </p>
      </div>
    </main>
  );
}

export default page;
