import Mainnav from "./../ui/mainnav";
import ContactForm from "./../ui/contactform";
import NavigationPanel from "./../ui/navigationpanel";
import MessageBubble from "@/ui/MessageBubble";
import ChatSidebar from "@/ui/ChatSidebar";
export default async function Home() {
  return (
    <div className="flex-1 flex flex-col items-center px-[10px] sm:px-[0px] py-[30px]  min-w-full min-h-full relative bg-gray-100 ">
      <div className="text-wrap  flex flex-col  ">
        <div className="flex justify-center h-min w-full  border-b-[3px] border-b-teal-500 ">
          <div className="relative">
            <p className="ord-text sm:bigger-text font-semibold bg-orange-300 rounded-full max-w-[300px] rounded-br-none sm:p-[20px] p-[10px] ">
              Бесплатные материалы по английскому, математике и другим
              предметам!
            </p>
          </div>
          <img
            src="/people.png"
            className="  w-[110px] h-[110px] md:w-[300px] md:h-[300px]"
          />
        </div>
      </div>
      <div className="text-wrap ord-text flex flex-col">
        <p className="bigger-text font-semibold bg-purple-200 p-[10px] rounded-lg">
          {" "}
          Информация для партнёров, мои проекты
        </p>
        <p className="font-semibold ml-[15px] mt-[10px]">
          1. Бесплатное очное обучение для детей из бедных семей и для всех
          желающих.
        </p>
        <p className="ord-text">
          Могу учить школьной программе по математике, английскому,
          программированию вебсайтов, дизайну в Figma, моделированию в Blender.
          Помогу найти то, что интересно ребенку и увлечь его полезным делом.
        </p>
        <p className="font-semibold mt-[10px]">Курс по английскому</p>
        <p>
          На этом сайте есть во вкладке Разные курсы/ English есть список уроков
          для каждого уровня. На данный момент они не все заполнены, но в скором
          времени я их заполню. Выбираем с ребятами их уровень, если их средний
          уровень A2 то будем заниматься по курсу A2 на данном вебсайте. Я
          рассказываю тему очно и даю детям устные задания, будем работать в
          группах, говорить на английском. Так всем будет веселее. Всё что было
          сказано мной очно будет дублированно на вебсайте и ребёнок в любой
          момент может перепройти этот урок если не смог прийти на очное
          занятие/не понял тему. К каждому уроку онлайн будет тест для проверки
          слабых мест, оценки за него не ставятся, чтобы не вызывать лишний
          стресс. Также каждый урок можно пометить как понятный или непонятный,
          так дети могут дать мне обратную связь, также любой юзер может
          написать комментарий со своими предложениями. Также хочу обратить ваше
          внимание что на сайте есть ИИ учитель, он ответит на любой вопрос
          ребенка в считанные секунды. Это приучает ребят не бояться смотреть на
          свои пробелы в знаниях. Буду учить детей пользоваться нейросетями для
          ускорения обучения
        </p>
        <p>
          По плану занятий. Занятия будут идти меньше часа, чтобы не перегружать
          детей. В начале повторяем уже пройденную тему устно, задаю пару
          вопросов по теме и те, кто первым правильно ответил получают очки.
          После повторения, если прошлая тема была усвоена проходим новую тему.
          Я обьясняю материал у доски и желательно дети делают записи в тетрадях
          или блокнотах, так им будет легче запомнить. После отвечаю на вопросы
          детей по теме и решаем тестовые задания по теме. Для разбавления
          рутины с определенной переодичностью будут проводиться чисто игровые
          занятия где мы будем играть в игры на английском - состовлять
          английские слова на скорость, кто больше знает английских слов, кто
          увереннее ведёт диалог.{" "}
        </p>
        <p>
          {" "}
          Пример первого занятия. Знакомлюсь с ребятами и спрашиваю каждого из
          них про их уровень английского. Начнём с темы - животные. Какое
          животное ребята хотели бы завести в качестве доманего питомца, какие
          животные им нравятся? Дам шаблоны ответов на лёгкие вопросы на доске и
          научу отвечать короткими предложениями по типу I agree, I disagree, I
          like .. Поучимся вести диалог. Также будет игра кто первый скажет
          название животного на английском. Если возраст и усидчивость позволяют
          - расскажу как составлять предложения в Present Simple (для более
          старших детей).{" "}
        </p>
        <p className="font-semibold mt-[10px]">Курс по математике</p>
        <p>
          {" "}
          Посмотрю уровень ребят по школьной программе и будем собираться вместе
          и прорешивать непонятные им задачи, можем пойти на обгон школьной
          программы, если будет желание.
        </p>
        <p className="font-semibold mt-[10px]">
          Программирование вебсайтов для детей и всех желающих
        </p>
        <p>
          {" "}
          Данный вебсайт сделан на технологии nextjs, это самый простой вариант
          для создания вебсайтов - идеален для школьников. В нашу эру у каждого
          амбициозного человека есть свой вебсайт, знания в сфере IT это ценное
          вложение в будущее. Сначала лично обсудим с каждым ребенком что ему
          нравится делать и какие у него цели, исходя из этого придумаем, какой
          он хочет вебсайт и для каких целей. Мы сделаем с каждым ребенком
          настоящий проект со своей уникальной идеей, а не просто шаблонный
          вебсайт. Если ребенок не смог определиться - сделаем вебсайт-визитку с
          его работами, допустим, вебсайт-визитка с рисунками вашей дочки, как у
          настоящего профессионального дизайнера.
        </p>

        <p></p>
      </div>

      <div className="text-wrap flex  flex-col">
        <p className="bigger-text font-semibold"> Рекомендую</p>
        <p className="ord-text">
          Чтобы учить английский перейдите в &apos;Бесплатные материалы&apos;,
          там уже доступен урок и тест к нему. Чтобы учиться математике нажмите
          &apos;Математика&apos; и выберите интересующую тему. Чтобы записаться
          на очный кружок нажмите на &apos;Кружок английского
          &apos;Шэкспир&apos;
        </p>
      </div>
      <div className="text-wrap  h-[320px] sm:h-[280px] mb-[50px]  flex flex-col">
        <p className="font-semibold ">
          В будущем также планируется реализовать данные функции:
        </p>
        <div className="flex flex-row mt-[10px] ord-text relative">
          <div className="rounded-full absolute smaller-text w-[40px] h-[40px] bg-yellow-500">
            {" "}
          </div>{" "}
          <p className="absolute sm:mt-[5px] ml-[35px]">
            ИИ-собеседник для лучшей практики говорения на иностранном языке
          </p>
        </div>
        <div className="flex flex-row relative ord-text mt-[60px] sm:mt-[45px]  ml-[10px]">
          <div className="rounded-full absolute w-[45px] h-[45px] bg-purple-400">
            {" "}
          </div>{" "}
          <p className="absolute ml-[35px] mt-[10px]">
            Своя программа для сдачи больших тестов
          </p>
        </div>
        <div className="flex flex-row relative ord-text mt-[60px] sm:mt-[50px]  ml-[3px]">
          <div className="rounded-full absolute w-[36px] h-[36px] bg-blue-400">
            {" "}
          </div>{" "}
          <p className="absolute ml-[35px]">
            Кружок по программированию, фокус на DevOps и Web-development
          </p>
        </div>
        <div className="flex flex-row relative ord-text mt-[60px] sm:mt-[50px]  ml-[3px]">
          <div className="rounded-full absolute w-[40px] h-[40px] bg-orange-400"></div>{" "}
          <p className="absolute ml-[35px] sm:mt-[5px]">
            Курс подготовки к ЕГЭ по профильной математике
          </p>
        </div>
      </div>
    </div>
  );
}
